#### Import library

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

#### Import dataset

In [34]:
data = {'Gender': ['Male', 'Female', 'Female', 'Male'],
        'Country': ['Germany', 'France', 'Spain', 'Germany'], 
        'Purchased': ['Yes', 'No', 'No', 'Yes'], 
        'Salary': [10, 20, 35, 48]
}

df = pd.DataFrame(data)
df

   Gender  Country Purchased  Salary
0    Male  Germany       Yes      10
1  Female   France        No      20
2  Female    Spain        No      35
3    Male  Germany       Yes      48

#### Option 1

In [35]:
df1 = pd.get_dummies(df, drop_first=True) #To avoid multicollinearity (especially useful for regression models)
df1

   Salary  Gender_Male  Country_Germany  Country_Spain  Purchased_Yes
0      10            1                1              0              1
1      20            0                0              0              0
2      35            0                0              1              0
3      48            1                1              0              1

#### Option 2

In [36]:
from sklearn.preprocessing import OneHotEncoder

encoder = OneHotEncoder(drop='first', sparse=False)  # drop='first' to avoid multicollinearity
encoded_data = encoder.fit_transform(df[['Gender', 'Country', 'Purchased']])
feature_names = encoder.get_feature_names_out(['Gender', 'Country', 'Purchased'])
encoded_df = pd.DataFrame(encoded_data, columns=feature_names, dtype=int)

df2 = pd.concat([encoded_df, df[['Salary']].reset_index(drop=True)], axis=1)

df2

   Gender_Male  Country_Germany  Country_Spain  Purchased_Yes  Salary
0            1                1              0              1      10
1            0                0              0              0      20
2            0                0              1              0      35
3            1                1              0              1      48